## Understanding pandas library

### importing the library

In [ ]:
import pandas as pd

writiing and saving files :

In [ ]:
import pandas as pd 
data ={ 'Name':['Ram','Shayam','Om'],
        'Age': [10,20,30],
        'City':['Indore','Chennai','Pune']}

df=pd.DataFrame(data)

df.to_csv("Information.csv",index=False)

#Similarly for to_excel(name.xlsx)and to_json(name.json)

### importing a file .

In [ ]:
import pandas as pd 
df=pd.read_csv("Information.csv")
print(df)

# for excel file use : pd.read_excel("Name.xlsx")
# for json file use ; pd.read_json("Name.json")

     Name  Age     City
0     Ram   10   Indore
1  Shayam   20  Chennai
2      Om   30     Pune

### reading rows from top

In [11]:
df.head(2)

     Name  Age     City
0     Ram   10   Indore
1  Shayam   20  Chennai

### Reading rows from bottom

In [13]:
df.tail(2)

     Name  Age     City
1  Shayam   20  Chennai
2      Om   30     Pune

### Understanding Data

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

### Describe Data

In [15]:
df.describe()

        Age
count   3.0
mean   20.0
std    10.0
min    10.0
25%    15.0
50%    20.0
75%    25.0
max    30.0

### know the shape and size of your dataset

In [18]:
import pandas as pd 
data ={ "Name":["Ram",'Sayam','Birju','Honey','Duggu','Shruti','Kamlesh','Suresh'],
       "AGE":[10,20,22,28,30,45,65,35],
       "Salary":[25000,45000,20000,10000,60000,70000,50000,15000],
       "Performance":[0,1,0,0,1,0,1,1]}

df=pd.DataFrame(data)

print(f"SHAPE:{df.shape}")
print(f"columns:{df.columns}")

SHAPE:(8, 4)
columns:Index(['Name', 'AGE', 'Salary', 'Performance'], dtype='object')

### Selecting a particular column

In [19]:
print(df["AGE"])

0    10
1    20
2    22
3    28
4    30
5    45
6    65
7    35
Name: AGE, dtype: int64

### Multiple Column

In [31]:
print(df["Name"])

0        Ram
1      Sayam
2      Birju
3      Honey
4      Duggu
5     Shruti
6    Kamlesh
7     Suresh
Name: Name, dtype: object

### Conditional Formating

##### Print the data for salary > 20000 (SINGLE FORMATING!)

In [35]:
import pandas as pd 
data ={ "Name":["Ram",'Sayam','Birju','Honey','Duggu','Shruti','Kamlesh','Suresh'],
       "AGE":[10,20,22,28,30,45,65,35],
       "Salary":[25000,45000,20000,10000,60000,70000,50000,15000],
       "Performance":[0,1,0,0,1,0,1,1]}

df=pd.DataFrame(data)

# SINGLE CONDITIONAL ; Salary above 20000
hg_sal= df[df["Salary"]>20000]
print(hg_sal)

      Name  AGE  Salary  Performance
0      Ram   10   25000            0
1    Sayam   20   45000            1
4    Duggu   30   60000            1
5   Shruti   45   70000            0
6  Kamlesh   65   50000            1

In [40]:
# MULTIPLE CONDITIONAL : Age>30 and salary>20k
c_sal= df[(df["AGE"]>30) & (df["Salary"]>20000)]
print(c_sal)

      Name  AGE  Salary  Performance
5   Shruti   45   70000            0
6  Kamlesh   65   50000            1

### Adding columns.

In [ ]:
# new column created with salary increment of 10% 
df["Bonus"]=df["Salary"]*0.1

In [42]:
# AT specific location 
df.insert(0,"Employid",[101,102,103,104,None,106,107,108])
print(df)

   Employid     Name  AGE  Salary  Performance   Bonus
0     101.0      Ram   10   25000            0  2500.0
1     102.0    Sayam   20   45000            1  4500.0
2     103.0    Birju   22   20000            0  2000.0
3     104.0    Honey   28   10000            0  1000.0
4       NaN    Duggu   30   60000            1  6000.0
5     106.0   Shruti   45   70000            0  7000.0
6     107.0  Kamlesh   65   50000            1  5000.0
7     108.0   Suresh   35   15000            1  1500.0

### Updating the value in field

In [45]:
df.loc[0,"Salary"]=50000
# updating at specific location 
df

   Employid     Name  AGE    Salary  Performance   Bonus
0     101.0      Ram   10  50000.00         10.4  2500.0
1     102.0    Sayam   20  24498.78         14.4  4500.0
2     103.0    Birju   22   -501.22         10.4  2000.0
3     104.0    Honey   28 -10501.22         10.4  1000.0
4       NaN    Duggu   30  39498.78         14.4  6000.0
5     106.0   Shruti   45  49498.78         10.4  7000.0
6     107.0  Kamlesh   65  29498.78         14.4  5000.0
7     108.0   Suresh   35  -5501.22         14.4  1500.0

In [57]:
df["Salary"]=df["Salary"]-10000
df

   Employid     Name  AGE    Salary  Performance   Bonus
0     101.0      Ram   10  39498.78         10.4  2500.0
1     102.0    Sayam   20  34498.78         14.4  4500.0
2     103.0    Birju   22   9498.78         10.4  2000.0
3     104.0    Honey   28   -501.22         10.4  1000.0
4       NaN    Duggu   30  49498.78         14.4  6000.0
5     106.0   Shruti   45  59498.78         10.4  7000.0
6     107.0  Kamlesh   65  39498.78         14.4  5000.0
7     108.0   Suresh   35   4498.78         14.4  1500.0

### Removing a column

In [ ]:
df.drop(columns=['Performace','Salary'],inplace=True)
print(df)

   Employid     Name  AGE   Bonus
0     101.0      Ram   10  2500.0
1     102.0    Sayam   20  4500.0
2     103.0    Birju   22  2000.0
3     104.0    Honey   28  1000.0
4       NaN    Duggu   30  6000.0
5     106.0   Shruti   45  7000.0
6     107.0  Kamlesh   65  5000.0
7     108.0   Suresh   35  1500.0

### Dealing with th emissing Values

In [71]:
df.isnull()

   Employid   Name    AGE  Bonus
0     False  False  False  False
1     False  False  False  False
2     False  False  False  False
3     False  False  False  False
4      True  False  False  False
5     False  False  False  False
6     False  False  False  False
7     False  False  False  False

In [72]:
df.isnull().sum()

Employid    1
Name        0
AGE         0
Bonus       0
dtype: int64

In [76]:
df.fillna(0,inplace=True)


#df.["Employid"].fillna(df[xyz].mean(),inplace=True)
#df.["Salary"].fillna(df["Salary"].mean(),inplace=True)

df

   Employid     Name  AGE   Bonus
0     101.0      Ram   10  2500.0
1     102.0    Sayam   20  4500.0
2     103.0    Birju   22  2000.0
3     104.0    Honey   28  1000.0
4       0.0    Duggu   30  6000.0
5     106.0   Shruti   45  7000.0
6     107.0  Kamlesh   65  5000.0
7     108.0   Suresh   35  1500.0

### Interpolation

#### (Replaces missing values by studying the trends od that data)

In [77]:
df.interpolate(method="linear",axis=0,inplace=True)

C:\Users\surya\AppData\Local\Temp\ipykernel_19412\241462238.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear",axis=0,inplace=True)

### Sorting the data inside dataset

In [78]:
import pandas as pd 

data={"Name":["Punit","Kamlesh","Palak"],
      "Age":[10,23,62],
      "Salary":[20000,15000,30000]}

df=pd.DataFrame(data)

df.sort_values(by="Age",ascending=False,inplace=True)
df

      Name  Age  Salary
2    Palak   62   30000
1  Kamlesh   23   15000
0    Punit   10   20000

In [82]:
df.sort_values(by=["Age","Salary"],ascending=[True,False],inplace=True)
df

      Name  Age  Salary
0    Punit   10   20000
1  Kamlesh   23   15000
2    Palak   62   30000

### Aggregation .

In [ ]:
df['column name'].mean()
df['column name'].sum()
df['column name'].min()
df['column name'].max()
df['column name'].count()

### Grouping

In [85]:
df.groupby('Age')['Salary'].sum()

Age
10    20000
23    15000
62    30000
Name: Salary, dtype: int64

### Merging :

##### inner join - only matching values 
##### outer join - combines all and fill nan at unmatched 
##### left join - full data from left and only matching values of right rest Nan 
##### right join - full data from right nad only matcing value of lest rest Nan
##### cross join - m x n full dataset

In [91]:
# syntax 
# pd.merge(df1,df2 ,on='column name',how="inner/outer etc")

import pandas as pd 

cust={"custid":[10,20,30],
      "name":["Harry","Ravi","Summit"]}
df1=pd.DataFrame(cust)



order={"custid":[15,20,30],
       "status":["placed","not","placed"]}
df2=pd.DataFrame(order)


merge=pd.merge(df1,df2,on="custid",how="inner")
print(merge)

   custid    name  status
0      20    Ravi     not
1      30  Summit  placed

In [92]:

merge=pd.merge(df1,df2,on="custid",how="outer")
print(merge)

   custid    name  status
0      10   Harry     NaN
1      15     NaN  placed
2      20    Ravi     not
3      30  Summit  placed

In [93]:
merge=pd.merge(df1,df2,on="custid",how="left")
print(merge)

   custid    name  status
0      10   Harry     NaN
1      20    Ravi     not
2      30  Summit  placed

In [94]:
merge=pd.merge(df1,df2,on="custid",how="right")
print(merge)

   custid    name  status
0      15     NaN  placed
1      20    Ravi     not
2      30  Summit  placed